#include "iostream"

int main()
{
	std::cout << "Задача 1:" << "\n\n";

	setlocale(LC_ALL, "ru");
	int a1, a2, a3, a4, a5, a6, n;
	std::cout << "Введите шестизначное число от (0 до 999999):" << "\n";
	std::cin >> n;
	if (n > 999999)
	{
		std::cout << "Ошибка";

	}

	a1 = n / 100000;
	a2 = (n - a1 * 100000) / 10000;
	a3 = (n - a1 * 100000 - a2 * 10000) / 1000;
	a4 = (n - a1 * 100000 - a2 * 10000 - a3 * 1000) / 100;
	a5 = (n - a1 * 100000 - a2 * 10000 - a3 * 1000 - a4 * 100) / 10;
	a6 = (n - a1 * 100000 - a2 * 10000 - a3 * 1000 - a4 * 100 - a5 * 10);
	if (a1 + a2 + a3 == a4 + a5 + a6)
	{
		std::cout << "Вы выбрали счастливое число!";
	}
	else if (n < 999999)
	{
		std::cout << "У вас обычное число((";
	}

	std::cout << "\n\n" << "Задача2:" << "\n\n";

	int d1, d2, d3, d4, z, f;
	std::cout << "Введите четырёхзначное число:" << "\n";
	std::cin >> f;
	if (f > 9999)
	{
		std::cout << "Ошибка";

	}
	else if (f < 1000)
	{
		std::cout << "Ошибка";
	}
	d1 = f / 1000;
	d2 = (f - d1 * 1000) / 100;
	d3 = (f - d1 * 1000 - d2 * 100) / 10;
	d4 = (f - d1 * 1000 - d2 * 100 - d3 * 10);
	z = (d2 * 1000) + (d1 * 100) + (d4 * 10) + d3;
	std::cout << "\nВаше новое число равно: " << z;






	std::cout << "\n\n" << "Задача 3:" << "\n\n";
	double e1, e2, e3, e4, e5, e6, e7;

	std::cout << "Введите первое число:" << "\n";
	std::cin >> e1;

	std::cout << "Введите второе число:" << "\n";
	std::cin >> e2;

	std::cout << "Введите третье число:" << "\n";
	std::cin >> e3;

	std::cout << "Введите четвёртое число:" << "\n";
	std::cin >> e4;

	std::cout << "Введите пятое число:" << "\n";
	std::cin >> e5;

	std::cout << "Введите шестое число:" << "\n";
	std::cin >> e6;

	std::cout << "Введите седьмое число:" << "\n";
	std::cin >> e7;

	std::cout << e1 * e2 * e3 * e4 * e5 * e6 * e7;







	return 0;

}